
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.2 数据模型 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="3.html" />
    
    
    <link rel="prev" href="1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    第一章 绪论
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    1.1 数据库系统概述
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    1.2 数据模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="3.html">
            
                <a href="3.html">
            
                    
                    1.3 数据库系统的结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="4.html">
            
                <a href="4.html">
            
                    
                    1.4 数据库系统的组成
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="5.html">
            
                <a href="5.html">
            
                    
                    1.5 小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../Part2/">
            
                <a href="../Part2/">
            
                    
                    第二章 关系数据库
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../Part2/1.html">
            
                <a href="../Part2/1.html">
            
                    
                    2.1关系数据库结构及形式化定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../Part2/2.html">
            
                <a href="../Part2/2.html">
            
                    
                    2.2 关系操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../Part2/3.html">
            
                <a href="../Part2/3.html">
            
                    
                    2.3 关系的完整性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../Part/4.html">
            
                <a href="../Part/4.html">
            
                    
                    2.4 关系代数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../Part2/5.html">
            
                <a href="../Part2/5.html">
            
                    
                    2.5 关系演算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../Part2/6.html">
            
                <a href="../Part2/6.html">
            
                    
                    2.6 小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../Part3/">
            
                <a href="../Part3/">
            
                    
                    第三章 关系数据库标准语言SQL
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Part4/">
            
                <a href="../Part4/">
            
                    
                    第四章 数据库的安全性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../Part5/">
            
                <a href="../Part5/">
            
                    
                    第五章 数据库的完整性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../Part6/">
            
                <a href="../Part6/">
            
                    
                    第六章 关系数据库理论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../Part7/">
            
                <a href="../Part7/">
            
                    
                    第七章 数据库设计
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.2 数据模型</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="12-&#x6570;&#x636E;&#x6A21;&#x578B;">1.2 &#x6570;&#x636E;&#x6A21;&#x578B;</h1>
<blockquote>
<p>&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x5BF9;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x6570;&#x636E;&#x7279;&#x5F81;&#x7684;&#x62BD;&#x8C61;&#xB7;&#xFF0C;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x6570;&#x636E;&#x3001;&#x7EC4;&#x7EC7;&#x6570;&#x636E;&#x548C;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x3002;</p>
<p>&#x73B0;&#x6709;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x5747;&#x662F;&#x57FA;&#x7840;&#x67D0;&#x79CD;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x3002;<strong>&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x6570;&#x636E;&#x9879;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;&#x548C;&#x57FA;&#x7840;&#x3002;</strong></p>
</blockquote>
<h3 id="121&#x4E24;&#x7C7B;&#x6570;&#x636E;&#x7C7B;&#x578B;">1.2.1&#x4E24;&#x7C7B;&#x6570;&#x636E;&#x7C7B;&#x578B;</h3>
<p>&#x6570;&#x636E;&#x6A21;&#x578B;&#x5E94;&#x5F53;&#x6EE1;&#x8DB3;&#x4E09;&#x65B9;&#x9762;&#x8981;&#x6C42;</p>
<ol>
<li>&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x771F;&#x5B9E;&#x6A21;&#x62DF;&#x73B0;&#x5B9E;&#x4E16;&#x754C;</li>
<li>&#x5BB9;&#x6613;&#x4E3A;&#x4EBA;&#x6240;&#x7406;&#x89E3;</li>
<li>&#x4FBF;&#x4E8E;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5B9E;&#x73B0;</li>
</ol>
<p>&#x6839;&#x636E;&#x6A21;&#x578B;&#x5E94;&#x7528;&#x7684;&#x4E0D;&#x540C;&#x76EE;&#x7684;&#xFF0C;&#x5C06;&#x6A21;&#x578B;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x7C7B;&#xFF0C;&#x5206;&#x522B;&#x5C5E;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x6B21;&#xFF1A;&#x6982;&#x5FF5;&#x6A21;&#x578B;   |     &#x903B;&#x8F91;&#x6A21;&#x578B;&#x548C;&#x7269;&#x7406;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x7C7B;&#x662F;&#x6982;&#x5FF5;&#x6A21;&#x578B;&#xFF0C;&#x4E5F;&#x79F0;&#x4FE1;&#x606F;&#x6A21;&#x578B;&#xFF0C;&#x662F;&#x6309;&#x7167;&#x7528;&#x6237;&#x7684;&#x89C2;&#x70B9;&#x6765;&#x5BF9;&#x6570;&#x636E;&#x548C;&#x4FE1;&#x606F;&#x5EFA;&#x6A21;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x7C7B;&#x4E2D;&#x7684;&#x903B;&#x8F91;&#x6A21;&#x578B;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x3001;&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x3001;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x3001;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x548C;&#x5BF9;&#x8C61;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3001;&#x534A;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7B49;&#x3002;&#x662F;&#x6309;&#x7167;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x89C2;&#x70B9;&#x5BF9;&#x6570;&#x636E;&#x5EFA;&#x6A21;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x7C7B;&#x4E2D;&#x7684;&#x7269;&#x7406;&#x6A21;&#x578B;&#x662F;&#x5BF9;&#x6570;&#x636E;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5B83;&#x63CF;&#x8FF0;&#x6570;&#x636E;&#x5728;&#x7CFB;&#x7EDF;&#x5185;&#x90E8;&#x7684;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x548C;&#x5B58;&#x53D6;&#x65B9;&#x6CD5;&#xFF0C;&#x6216;&#x5728;&#x78C1;&#x76D8;&#x6216;&#x78C1;&#x5E26;&#x4E0A;&#x7684;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#x548C;&#x5B58;&#x53D6;&#x65B9;&#x6CD5;&#xFF0C;&#x9762;&#x5411;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#xFF0C;&#x7528;&#x6237;&#x4E0D;&#x5FC5;&#x8003;&#x8651;&#x7269;&#x7406;&#x7EA7;&#x7EC6;&#x8282;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x628A;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x5177;&#x4F53;&#x4E8B;&#x7269;&#x62BD;&#x8C61;&#x3001;&#x7EC4;&#x7EC7;&#x4E3A;&#x67D0;&#x4E00;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x652F;&#x6301;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5148;&#x5C06;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x62BD;&#x8C61;&#x4E3A;&#x4FE1;&#x606F;&#x4E16;&#x754C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x4FE1;&#x606F;&#x4E16;&#x754C;&#x62BD;&#x8C61;&#x4E3A;&#x673A;&#x5668;&#x4E16;&#x754C;</p>
<hr>
<h3 id="122&#x6982;&#x5FF5;&#x6A21;&#x578B;">1.2.2&#x6982;&#x5FF5;&#x6A21;&#x578B;</h3>
<p>&#x6982;&#x5FF5;&#x6A21;&#x578B;&#x5176;&#x5B9E;&#x662F;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x5230;&#x673A;&#x5668;&#x4E16;&#x754C;&#x7684;&#x4E2D;&#x95F4;&#x5C42;&#x6B21;&#x3002;</p>
<h5 id="&#x4FE1;&#x606F;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;">&#x4FE1;&#x606F;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</h5>
<ol>
<li>&#x5B9E;&#x4F53; entity
&#x5B9E;&#x4F53;&#x662F;&#x5B58;&#x5728;&#x5E76;&#x4E14;&#x53EF;&#x76F8;&#x4E92;&#x533A;&#x522B;&#x7684;&#x4E8B;&#x7269;&#x79F0;&#x4E3A;&#x5B9E;&#x4F53;&#x3002;&#x53EF;&#x4EE5;&#x662F;&#x5177;&#x4F53;&#x7684;&#x4EBA;&#x3001;&#x4E8B;&#x3001;&#x7269;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x6982;&#x5FF5;&#x6216;&#x8054;&#x7CFB;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x5B66;&#x751F;&#xFF0C;&#x4E00;&#x4E2A;&#x804C;&#x5DE5;&#xFF0C;&#x4E00;&#x6B21;&#x5B66;&#x751F;&#x7684;&#x9009;&#x8BFE;&#xFF0C;&#x6559;&#x5E08;&#x4E0E;&#x5B66;&#x9662;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x90FD;&#x662F;&#x5B9E;&#x4F53;&#x3002;</li>
<li>&#x5C5E;&#x6027; attribute
&#x5B9E;&#x4F53;&#x6240;&#x5177;&#x6709;&#x7684;&#x67D0;&#x4E00;&#x7279;&#x6027;&#x79F0;&#x4E3A;&#x5C5E;&#x6027;&#x3002;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x53EF;&#x4EE5;&#x7531;&#x82E5;&#x5E72;&#x4E2A;&#x5C5E;&#x6027;&#x523B;&#x753B;&#x3002;</li>
<li>&#x7801; key
&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x5B9E;&#x4F53;&#x7684;&#x5C5E;&#x6027;&#x96C6;&#x79F0;&#x4E3A;&#x7801;&#x3002;&#x4F8B;&#x5982;&#x5B66;&#x53F7;&#x662F;&#x5B66;&#x751F;&#x5B9E;&#x4F53;&#x7684;&#x7801;&#x3002;</li>
<li>&#x5B9E;&#x4F53;&#x578B; entity type
&#x5177;&#x6709;&#x76F8;&#x540C;&#x5C5E;&#x6027;&#x7684;&#x5B9E;&#x4F53;&#x5FC5;&#x7136;&#x5177;&#x6709;&#x5171;&#x540C;&#x7684;&#x7279;&#x5F81;&#x548C;&#x6027;&#x8D28;&#x3002;&#x7528;&#x5B9E;&#x4F53;&#x540D;&#x53CA;&#x5176;&#x5C5E;&#x6027;&#x540D;&#x96C6;&#x5408;&#x6765;&#x62BD;&#x8C61;&#x548C;&#x523B;&#x753B;&#x540C;&#x7C7B;&#x5B9E;&#x4F53;&#xFF0C;&#x79F0;&#x4E3A;&#x5B9E;&#x4F53;&#x578B;&#x3002;&#xFF0C;&#x4F8B;&#x5982;&#x5B66;&#x751F;&#xFF08;&#x5B66;&#x53F7;&#xFF0C;&#x59D3;&#x540D;&#xFF0C;&#x6027;&#x522B;&#xFF0C;&#x73ED;&#x7EA7;&#xFF09;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x578B;&#x3002;</li>
<li>&#x5B9E;&#x4F53;&#x96C6; entity set
&#x540C;&#x4E00;&#x7C7B;&#x578B;&#x5B9E;&#x4F53;&#x7684;&#x96C6;&#x5408;&#x79F0;&#x4E3A;&#x5B9E;&#x4F53;&#x96C6;&#x3002;&#x5168;&#x4F53;&#x5B66;&#x751F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x96C6;&#x3002;</li>
<li><p>&#x8054;&#x7CFB; relationship</p>
<pre><code> &#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x901A;&#x5E38;&#x662F;&#x6307;&#x4E0D;&#x540C;&#x5B9E;&#x4F53;&#x96C6;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x3002;

 &#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x6709;&#x4E00;&#x5BF9;&#x4E00;&#x3001;&#x4E00;&#x5BF9;&#x591A;&#x548C;&#x591A;&#x5BF9;&#x591A;&#x7B49;&#x591A;&#x79CD;&#x7C7B;&#x578B;&#x3002;&#xFF08;page17&#xFF09;
</code></pre></li>
</ol>
<h5 id="&#x6982;&#x5FF5;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#xFF1A;&#x5B9E;&#x4F53;-&#x8054;&#x7CFB;&#x65B9;&#x6CD5;">&#x6982;&#x5FF5;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#xFF1A;&#x5B9E;&#x4F53;-&#x8054;&#x7CFB;&#x65B9;&#x6CD5;</h5>
<p>P.P.S.Chen &#x4E8E;1976&#x5E74;&#x63D0;&#x51FA;<strong>&#x5B9E;&#x4F53;-&#x8054;&#x7CFB;&#x65B9;&#x6CD5;&#xFF0C;</strong>&#x5373;E-R&#x56FE;&#xFF0C;E-R&#x65B9;&#x6CD5;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;E-R&#x6A21;&#x578B;&#x3002;</p>
<hr>
<h3 id="123&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x7EC4;&#x6210;&#x8981;&#x7D20;">1.2.3&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x7EC4;&#x6210;&#x8981;&#x7D20;</h3>
<p>&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x4E25;&#x683C;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x7EC4;&#x6982;&#x5FF5;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x7CBE;&#x786E;&#x7684;&#x63CF;&#x8FF0;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x9759;&#x6001;&#x7279;&#x6027;&#x3001;&#x52A8;&#x6001;&#x7279;&#x6027;&#x548C;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x3002;&#x56E0;&#x6B64;<strong>&#x6570;&#x636E;&#x6A21;&#x578B;&#x901A;&#x5E38;&#x7531;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3001;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x548C;&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x4E09;&#x90E8;&#x5206;&#x6784;&#x6210;&#x3002;</strong></p>
<ol>
<li>&#x6570;&#x636E;&#x7ED3;&#x6784;
&#x6570;&#x636E;&#x7ED3;&#x6784;&#x63CF;&#x8FF0;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7EC4;&#x6210;&#x5BF9;&#x8C61;&#x4EE5;&#x53CA;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x63CF;&#x8FF0;&#x7684;&#x5173;&#x7CFB;&#x6709;&#x4E24;&#x7C7B;&#xFF08;&#x5BF9;&#x8C61;&#x548C;&#x5173;&#x7CFB;&#xFF0C;&#x4E2A;&#x4EBA;&#x7406;&#x89E3;&#xFF09;&#xFF1A;&#x4E00;&#x7C7B;&#x662F;&#x4E0E;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#x3001;&#x5185;&#x5BB9;&#x3001;&#x6027;&#x8D28;&#x6709;&#x5173;&#xFF0C;&#x5982;&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x9879;&#xFF0C;&#x8BB0;&#x5F55;&#xFF0C;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x57DF;&#x3001;&#x5C5E;&#x6027;&#x3001;&#x5173;&#x7CFB;&#x7B49;&#xFF1B;&#x4E00;&#x7C7B;&#x662F;&#x4E0E;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x8054;&#x7CFB;&#x6709;&#x5173;&#x7684;&#x5BF9;&#x8C61;&#x3002;<strong>&#x603B;&#x4E4B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x662F;&#x5BF9;&#x7CFB;&#x7EDF;&#x9759;&#x6001;&#x7279;&#x6027;&#x7684;&#x63CF;&#x8FF0;&#x3002;</strong></li>
<li>&#x6570;&#x636E;&#x64CD;&#x4F5C;
&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x662F;&#x6307;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5404;&#x79CD;&#x5BF9;&#x8C61;&#xFF08;&#x578B;&#xFF09;&#x7684;&#x5B9E;&#x4F8B;&#xFF08;&#x503C;&#xFF09;&#x5141;&#x8BB8;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5305;&#x62EC;&#x64CD;&#x4F5C;&#x53CA;&#x5176;&#x6709;&#x5173;&#x7684;&#x64CD;&#x4F5C;&#x89C4;&#x5219;&#x3002;
&#x6570;&#x636E;&#x5E93;&#x4E3B;&#x8981;&#x6709;&#x67E5;&#x8BE2;&#x548C;&#x66F4;&#x65B0;&#xFF08;&#x63D2;&#x5165;&#x3001;&#x5220;&#x9664;&#x3001;&#x4FEE;&#x6539;&#xFF09;&#x4E24;&#x5927;&#x7C7B;&#x64CD;&#x4F5C;&#x3002;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5FC5;&#x987B;&#x5B9A;&#x4E49; &#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x7684;&#x786E;&#x5207;&#x542B;&#x4E49;&#x3001;&#x64CD;&#x4F5C;&#x7B26;&#x53F7;&#x3001;&#x64CD;&#x4F5C;&#x89C4;&#x5219;&#xFF08;&#x5982;&#x4F18;&#x5148;&#x7EA7;&#xFF09;&#x548C;&#x5B9E;&#x73B0;&#x64CD;&#x4F5C;&#x7684;&#x8BED;&#x8A00;&#x3002;<strong>&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x662F;&#x5BF9;&#x7CFB;&#x7EDF;&#x52A8;&#x6001;&#x7279;&#x6027;&#x7684;&#x63CF;&#x8FF0;&#x3002;</strong></li>
<li>&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;&#x6761;&#x4EF6;
&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;&#x662F;&#x6307;&#x4E00;&#x7EC4;&#x5B8C;&#x6574;&#x7684;&#x89C4;&#x5219;&#x3002;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x6B63;&#x786E;&#x3001;&#x6709;&#x6548;&#x548C;&#x76F8;&#x5BB9;&#x3002;</li>
</ol>
<h3 id="124-&#x5E38;&#x7528;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;">1.2.4 &#x5E38;&#x7528;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;</h3>
<p>&#x6570;&#x636E;&#x5E93;&#x9886;&#x57DF;&#x4E3B;&#x8981;&#x7684;&#x903B;&#x8F91;&#x6A21;&#x578B;&#xFF1A;</p>
<ol>
<li>&#x5C42;&#x6B21;&#x6A21;&#x578B;&#xFF08;&#x683C;&#x5F0F;&#x5316;&#x6A21;&#x578B;&#xFF09;</li>
<li>&#x7F51;&#x72B6;&#x6A21;&#x578B;&#xFF08;&#x683C;&#x5F0F;&#x5316;&#x6A21;&#x578B;&#xFF09;</li>
<li>&#x5173;&#x7CFB;&#x6A21;&#x578B;</li>
<li>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x6570;&#x636E;&#x6A21;&#x578B;</li>
<li>&#x5BF9;&#x8C61;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x6A21;&#x578B;</li>
<li>&#x534A;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF08;XML&#xFF09;</li>
</ol>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x523B;&#x753B;&#x6A21;&#x578B;&#x6027;&#x8D28;&#x7684;&#x6700;&#x57FA;&#x672C;&#x65B9;&#x9762;&#x3002;</p>
<p>&#x5728;&#x683C;&#x5F0F;&#x5316;&#x6A21;&#x578B;&#x4E2D;&#x5B9E;&#x4F53;&#x7528;&#x8BB0;&#x5F55;&#x8868;&#x793A;&#xFF0C;&#x5B9E;&#x4F53;&#x7684;&#x5C5E;&#x6027;&#x5BF9;&#x5E94;&#x8BB0;&#x5F55;&#x7684;&#x6570;&#x636E;&#x9879;&#xFF08;&#x6216;&#x5B57;&#x6BB5;&#xFF09;&#x3002;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x8F6C;&#x5316;&#x4E3A; &#x8BB0;&#x5F55;&#x4E4B;&#x95F4;&#x7684;&#x4E24;&#x4E24;&#x5173;&#x7CFB;&#x3002;</p>
<h3 id="125-&#x5C42;&#x6B21;&#x6A21;&#x578B;">1.2.5 &#x5C42;&#x6B21;&#x6A21;&#x578B;</h3>
<h5 id="1&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;">1.&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;</h5>
<p>&#x51FA;&#x73B0;&#x6700;&#x65E9;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;&#x5178;&#x578B;&#x4EE3;&#x8868;IMS&#x3002;&#x7528;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x8868;&#x793A;&#x5404;&#x7C7B;&#x5B9E;&#x4F53;&#x4EE5;&#x53CA;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x73B0;&#x5B9E;&#x4E2D;&#x5982;&#x884C;&#x653F;&#x673A;&#x6784;&#xFF0C;&#x5BB6;&#x65CF;&#x5173;&#x7CFB;&#x3002;&#x53EA;&#x80FD;&#x5904;&#x7406;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x5B9E;&#x4F53;&#x8054;&#x7CFB;&#x3002;</p>
<pre><code>&#x53CC;&#x4EB2;&#x7ED3;&#x70B9; &#x6839;&#x7ED3;&#x70B9; &#x5144;&#x5F1F;&#x7ED3;&#x70B9; &#x53F6;&#x7ED3;&#x70B9; &#x5B50;&#x5973;&#x7ED3;&#x70B9;
</code></pre><p>&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;&#x8BB0;&#x5F55;&#x503C;&#x53EA;&#x80FD;&#x6309;&#x5176;&#x5C42;&#x6B21;&#x8DEF;&#x5F84;&#x67E5;&#x770B;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x5B50;&#x5973;&#x8BB0;&#x5F55;&#x503C;&#x80FD;&#x591F;&#x8131;&#x79BB;&#x53CC;&#x4EB2;&#x8BB0;&#x5F55;&#x503C;&#x800C;&#x72EC;&#x7ACB;&#x5B58;&#x5728;&#x3002;</p>
<h5 id="2&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x64CD;&#x7EB5;&#x548C;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;">2.&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x64CD;&#x7EB5;&#x548C;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;</h5>
<p>&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x64CD;&#x7EB5;&#x4E3B;&#x8981;&#x6709;&#x67E5;&#x8BE2;&#x3001;&#x63D2;&#x5165;&#x3001;&#x5220;&#x9664;&#x548C;&#x66F4;&#x65B0;&#x3002;&#x8FDB;&#x884C;&#x63D2;&#x5165;&#x3001;&#x5220;&#x9664;&#x548C;&#x66F4;&#x65B0;&#x8981;&#x6EE1;&#x8DB3;&#x5C42;&#x6B21;&#x6027;&#x6A21;&#x578B;&#x7684;&#x5B8C;&#x6574;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x63D2;&#x5165;&#x64CD;&#x4F5C;&#xFF0C;&#x76F8;&#x5E94;&#x76F8;&#x5E94;&#x7684;&#x53CC;&#x4EB2;&#x7ED3;&#x70B9;&#x503C;&#x5C31;&#x4E0D;&#x80FD;&#x63D2;&#x5165;&#x5B83;&#x7684;&#x5B50;&#x5973;&#x7ED3;&#x70B9;&#x503C;&#x3002;</p>
<p>&#x5220;&#x9664;&#x64CD;&#x4F5C;&#xFF0C;&#x5220;&#x9664;&#x53CC;&#x4EB2;&#x7ED3;&#x70B9;&#x503C;&#xFF0C;&#xFF0C;&#x6240;&#x6709;&#x5B50;&#x5973;&#x8282;&#x70B9;&#x503C;&#x4E5F;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#x3002;</p>
<h5 id="3&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x4F18;&#x70B9;">3.&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x4F18;&#x70B9;</h5>
<ol>
<li>&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6BD4;&#x8F83;&#x6E05;&#x6670;&#x7B80;&#x5355;</li>
<li>&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x9AD8;&#xFF0C;&#x8054;&#x7CFB;&#x7528;&#x6709;&#x5411;&#x8FB9;&#x8868;&#x793A;&#xFF0C;&#x6027;&#x80FD;&#x4F18;&#x4E8E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x3001;&#x4E0D;&#x4F4E;&#x4E8E;&#x7F51;&#x72B6;&#x6570;&#x636E;&#x5E93;&#x3002;</li>
<li>&#x63D0;&#x4F9B;&#x4E86;&#x826F;&#x597D;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x652F;&#x6301;&#x3002;</li>
</ol>
<h5 id="4&#x3002;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x7F3A;&#x70B9;">4&#x3002;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x7F3A;&#x70B9;</h5>
<ol>
<li>&#x73B0;&#x5B9E;&#x4E2D;&#x5F88;&#x591A;&#x8054;&#x7CFB;&#x975E;&#x5C42;&#x6B21;&#x6027;&#xFF0C;&#x5373;&#x591A;&#x5BF9;&#x591A;&#x4E0D;&#x9002;&#x5408;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x53CC;&#x4EB2;&#x7ED3;&#x70B9;&#xFF0C;&#x5C31;&#x4F1A;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x9020;&#x6210;&#x5197;&#x4F59;</li>
<li>&#x67E5;&#x8BE2;&#x5B50;&#x5973;&#x7ED3;&#x70B9;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x53CC;&#x4EB2;&#x7ED3;&#x70B9;</li>
<li>&#x7531;&#x4E8E;&#x7ED3;&#x6784;&#x4E25;&#x5BC6;&#xFF0C;&#x5C42;&#x6B21;&#x547D;&#x4EE4;&#x8D8B;&#x4E8E;&#x7A0B;&#x5E8F;&#x5316;</li>
</ol>
<h3 id="126-&#x7F51;&#x72B6;&#x6A21;&#x578B;">1.2.6 &#x7F51;&#x72B6;&#x6A21;&#x578B;</h3>
<p>&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x4E8B;&#x7269;&#x4E4B;&#x95F4;&#x8054;&#x7CFB;&#x66F4;&#x591A;&#x662F;&#x975E;&#x5C42;&#x6B21;&#x6027;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x7528;&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x6765;&#x8868;&#x793A;&#x3002;&#x7F51;&#x72B6;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x5178;&#x578B;&#x4EE3;&#x8868;&#x662F; <strong>DBTG&#x7CFB;&#x7EDF;&#xFF0C;&#x4EA6;&#x79F0;&#x4E3A;CODASYL&#x7CFB;&#x7EDF;&#x3002;</strong></p>
<h5 id="1&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;">1.&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;</h5>
<p>&#x6EE1;&#x8DB3;&#x4E00;&#x4E0B;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x7684;&#x57FA;&#x672C;&#x5C42;&#x6B21;&#x8054;&#x7CFB;&#x96C6;&#x5408;&#x79F0;&#x4E3A;&#x7F51;&#x72B6;&#x6A21;&#x578B;</p>
<pre><code>1. &#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x4EE5;&#x4E0A;&#x7ED3;&#x70B9;&#x65E0;&#x53CC;&#x4EB2;
2. &#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4F59;&#x4E00;&#x4E2A;&#x7684;&#x53CC;&#x4EB2;&#x7ED3;&#x70B9;
</code></pre><p>&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x5176;&#x5B9E;&#x662F;&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x4F8B;</p>
<p>&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x4E2D;&#x5B50;&#x5973;&#x7ED3;&#x70B9;&#x4E0E;&#x53CC;&#x4EB2;&#x7ED3;&#x70B9;&#x7684;&#x8054;&#x7CFB;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x5728;&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x4E2D;&#x53EF;&#x4EE5;&#x4E0D;&#x552F;&#x4E00;&#x3002;</p>
<p>&#x5B66;&#x751F;&#x9009;&#x8BFE;&#x5C31;&#x662F;&#x5178;&#x578B;&#x7684;&#x7F51;&#x72B6;&#x6A21;&#x578B;</p>
<h5 id="2&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x548C;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;">2.&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x7684;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x548C;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;</h5>
<ol>
<li>&#x652F;&#x6301;&#x8BB0;&#x5F55;&#x7801;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x7801;&#x5373;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x8BB0;&#x5F55;&#x7684;&#x6570;&#x636E;&#x9879;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x6BD4;&#x5982;&#x5B66;&#x751F;&#x7684;&#x5B66;&#x53F7;&#x3002;</li>
<li>&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x8054;&#x7CFB;&#x4E2D;&#x53CC;&#x4EB2;&#x8BB0;&#x5F55;&#x548C;&#x5B50;&#x5973;&#x8BB0;&#x5F55;&#x4E4B;&#x95F4;&#x662F;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x8054;&#x7CFB;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x53CC;&#x4EB2;&#x8BB0;&#x5F55;&#x548C;&#x5B50;&#x5973;&#x8BB0;&#x5F55;&#x7684;&#x67D0;&#x4E9B;&#x7EA6;&#x675F;</li>
</ol>
<h5 id="3&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x7684;&#x4F18;&#x70B9;">3.&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x7684;&#x4F18;&#x70B9;</h5>
<ol>
<li>&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x7684;&#x63CF;&#x8FF0;&#x73B0;&#x5B9E;&#x4E16;&#x754C;</li>
<li>&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x5B58;&#x53D6;&#x6548;&#x7387;&#x9AD8;&#x3002;</li>
</ol>
<h5 id="4&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x7684;&#x7F3A;&#x70B9;">4+&#x7F51;&#x72B6;&#x6A21;&#x578B;&#x7684;&#x7F3A;&#x70B9;</h5>
<ol>
<li>&#x7ED3;&#x6784;&#x590D;&#x6742;</li>
<li>&#x8981;&#x5D4C;&#x5165;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x6613;&#x638C;&#x63E1;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x4F7F;&#x7528;</li>
<li>&#x7531;&#x4E8E;&#x8BB0;&#x5F55;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x662F;&#x7531;&#x5B58;&#x53D6;&#x8DEF;&#x5F84;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x719F;&#x6089;&#x8DEF;&#x5F84;&#xFF0C;&#x4E86;&#x89E3;&#x7EC6;&#x8282;&#xFF0C;&#x52A0;&#x91CD;&#x4E86;&#x8D1F;&#x62C5;&#x3002;</li>
</ol>
<h3 id="127-&#x5173;&#x7CFB;&#x6A21;&#x578B;">1.2.7 &#x5173;&#x7CFB;&#x6A21;&#x578B;</h3>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5E38;&#x7528;&#x7684; xxxxxx</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.html" class="navigation navigation-prev " aria-label="Previous page: 1.1 数据库系统概述">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="3.html" class="navigation navigation-next " aria-label="Next page: 1.3 数据库系统的结构">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.2 数据模型","level":"1.2.2","depth":2,"next":{"title":"1.3 数据库系统的结构","level":"1.2.3","depth":2,"path":"Part1/3.md","ref":"Part1/3.md","articles":[]},"previous":{"title":"1.1 数据库系统概述","level":"1.2.1","depth":2,"path":"Part1/1.md","ref":"Part1/1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Part1/2.md","mtime":"2020-03-30T02:36:21.583Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-03-30T06:50:27.071Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

