
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.3 数据库系统的结构 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="4.html" />
    
    
    <link rel="prev" href="2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    第一章 绪论
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    1.1 数据库系统概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    1.2 数据模型
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.3" data-path="3.html">
            
                <a href="3.html">
            
                    
                    1.3 数据库系统的结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="4.html">
            
                <a href="4.html">
            
                    
                    1.4 数据库系统的组成
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="5.html">
            
                <a href="5.html">
            
                    
                    1.5 小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../Part2/">
            
                <a href="../Part2/">
            
                    
                    第二章 关系数据库
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../Part2/1.html">
            
                <a href="../Part2/1.html">
            
                    
                    2.1关系数据库结构及形式化定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../Part2/2.html">
            
                <a href="../Part2/2.html">
            
                    
                    2.2 关系操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../Part2/3.html">
            
                <a href="../Part2/3.html">
            
                    
                    2.3 关系的完整性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../Part/4.html">
            
                <a href="../Part/4.html">
            
                    
                    2.4 关系代数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../Part2/5.html">
            
                <a href="../Part2/5.html">
            
                    
                    2.5 关系演算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../Part2/6.html">
            
                <a href="../Part2/6.html">
            
                    
                    2.6 小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../Part3/">
            
                <a href="../Part3/">
            
                    
                    第三章 关系数据库标准语言SQL
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Part4/">
            
                <a href="../Part4/">
            
                    
                    第四章 数据库的安全性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../Part5/">
            
                <a href="../Part5/">
            
                    
                    第五章 数据库的完整性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../Part6/">
            
                <a href="../Part6/">
            
                    
                    第六章 关系数据库理论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../Part7/">
            
                <a href="../Part7/">
            
                    
                    第七章 数据库设计
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.3 数据库系统的结构</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="13-&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;">1.3 &#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;</h1>
<p>&#x6570;&#x636E;&#x5E93;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x5C42;&#x6B21;&#x6216;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x5EA6;&#x3002;</p>
<p>&#x5185;&#x90E8;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF1A;</p>
<pre><code>&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x770B;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x91C7;&#x7528;&#x4E09;&#x7EA7;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x5185;&#x90E8;&#x7684;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x3002;
</code></pre><p>&#x5916;&#x90E8;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF1A;</p>
<pre><code>&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x5206;&#x4E3A;&#x5355;&#x7528;&#x6237;&#x7ED3;&#x6784;&#x3001;&#x4E3B;&#x4ECE;&#x5F0F;&#x7ED3;&#x6784;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x7ED3;&#x6784;&#x3001;
&#x5BA2;&#x6237;-&#x670D;&#x52A1;&#x5668;&#x3001;&#x6D4F;&#x89C8;&#x5668;-&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;/ &#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x591A;&#x5C42;&#x7ED3;&#x6784;&#x7B49;&#x3002;
</code></pre><p>&#x672C;&#x8282;&#x4ECB;&#x7ECD;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#xFF08;&#x4E09;&#x6A21;&#x5F0F;&#x4E24;&#x6620;&#x50CF;&#xFF09;</p>
<h3 id="131-&#x6570;&#x636E;&#x5E93;&#x6A21;&#x5F0F;&#x7684;&#x6982;&#x5FF5;">1.3.1 &#x6570;&#x636E;&#x5E93;&#x6A21;&#x5F0F;&#x7684;&#x6982;&#x5FF5;</h3>
<p><strong>&#x5728;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x6709;&#x201C;&#x578B;&#x201D;&#xFF08;type&#xFF09; &#x548C; &#x201C;&#x503C;&#x201D;&#xFF08;value&#xFF09;&#x7684;&#x6982;&#x5FF5;&#x3002;</strong>&#x578B;&#x662F;&#x6307;&#x5BF9;&#x67D0;&#x4E00;&#x7C7B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x7ED3;&#x6784;&#x548C;&#x5C5E;&#x6027;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x503C;&#x662F;&#x578B;&#x7684;&#x5177;&#x4F53;&#x590D;&#x5236;&#x3002; &#x6BD4;&#x5982;&#xFF0C;&#x5B66;&#x751F;&#x8BB0;&#x5F55;&#x5B9A;&#x4E49;&#x4E3A;&#xFF08;&#x5B66;&#x53F7;&#xFF0C;&#x59D3;&#x540D;&#xFF0C;&#x6027;&#x522B;&#xFF0C;&#x7CFB;&#x522B;&#xFF0C;&#x7C4D;&#x8D2F;&#xFF09;&#x8FD9;&#x6837;&#x7684;&#x8BB0;&#x5F55;&#x578B;&#xFF0C;&#x800C;&#xFF08;20202020&#xFF0C;&#x53F6;&#x7E41;&#x661F;&#xFF0C;&#x5973;&#xFF0C;&#x4E2D;&#x6587;&#x7CFB;&#xFF0C;&#x56DB;&#x5DDD;&#x7701;&#x6210;&#x90FD;&#x5E02;&#xFF09;&#x5C31;&#x662F;&#x8BE5;&#x8BB0;&#x5F55;&#x578B;&#x7684;&#x4E00;&#x4E2A;&#x503C;&#x3002;</p>
<p><strong>&#x6A21;&#x5F0F;&#xFF08;schema&#xFF09;</strong> &#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5168;&#x4F53;&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x548C;&#x7279;&#x5F81;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x5B83;&#x4EC5;&#x4EC5;&#x6D89;&#x53CA; &#x578B;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;<strong>&#x4E0D;&#x6D89;&#x53CA;&#x5177;&#x4F53;&#x7684;&#x503C;&#x3002;</strong>&#x6A21;&#x5F0F;&#x7684;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x503C;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#xFF08;instance&#xFF09;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x6A21;&#x5F0F;&#x662F;&#x76F8;&#x5BF9;&#x7A33;&#x5B9A;&#x7684;&#xFF0C;&#x5B9E;&#x4F8B;&#x662F;&#x76F8;&#x5BF9;&#x53D8;&#x52A8;&#x7684;&#x3002;&#x6A21;&#x5F0F;&#x53CD;&#x5E94;&#x7684;&#x662F;&#x6570;&#x636E;&#x7684;&#x7ED3;&#x6784;&#x53CA;&#x5176;&#x8054;&#x7CFB;&#x3002;&#x800C;&#x5B9E;&#x4F8B;&#x53CD;&#x5E94;&#x7684;&#x662F;&#x6570;&#x636E;&#x5E93;&#x67D0;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4EA7;&#x54C1;&#x867D;&#x7136;&#x5404;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x5728;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E0A;&#x901A;&#x5E38;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5373;&#x91C7;&#x7528; &#x4E09;&#x7EA7;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x5E76;&#x63D0;&#x4F9B;&#x4E24;&#x7EA7;&#x6620;&#x50CF;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="132-&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x4E09;&#x7EA7;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;">1.3.2 &#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x4E09;&#x7EA7;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;</h3>
<p>&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x4E09;&#x7EA7;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x662F;&#x6307;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7531; <strong>&#x5916;&#x6A21;&#x5F0F;&#x3001;&#x6A21;&#x5F0F;&#x548C;&#x5185;&#x6A21;&#x5F0F;</strong>&#x4E09;&#x7EA7;&#x6784;&#x6210;&#x3002;</p>
<h5 id="1&#x6A21;&#x5F0F;&#xFF08;schema&#xFF09;">1.&#x6A21;&#x5F0F;&#xFF08;schema&#xFF09;</h5>
<p><strong>&#x6A21;&#x5F0F;&#x4E5F;&#x79F0;&#x903B;&#x8F91;&#x6A21;&#x5F0F;&#xFF0C;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5168;&#x4F53;&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x548C;&#x7279;&#x5F81;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x662F;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;&#x516C;&#x5171;&#x6570;&#x636E;&#x89C6;&#x56FE;</strong>&#x3002;&#x5B83;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x7684;&#x4E2D;&#x95F4;&#x5C42;&#xFF0C;&#x65E2;&#x4E0D;&#x6D89;&#x53CA;&#x7269;&#x7406;&#x5B58;&#x50A8;&#x4E5F;&#x548C;&#x5177;&#x4F53;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x5DE5;&#x5177;&#x7B49;&#x65E0;&#x5173;&#x3002;</p>
<p>&#x6A21;&#x5F0F;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#x5728;&#x903B;&#x8F91;&#x7EA7;&#x4E0A;&#x7684;&#x89C6;&#x56FE;&#x3002;<strong>&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x3002;</strong></p>
<p>&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;  &#x6A21;&#x5F0F;&#x6570;&#x636E;&#x5B9A;&#x4E49;&#x8BED;&#x8A00;&#xFF08;&#x6A21;&#x5F0F;DDL&#xFF09;  &#x6765;&#x4E25;&#x683C;&#x5B9A;&#x4E49;&#x6A21;&#x5F0F;&#x3002;</p>
<h5 id="2&#x5916;&#x6A21;&#x5F0F;&#xFF08;external-schemal&#xFF09;">2.&#x5916;&#x6A21;&#x5F0F;&#xFF08;external schemal&#xFF09;</h5>
<p>&#x5916;&#x6A21;&#x5F0F;&#x4E5F;&#x79F0;&#x5B50;&#x6A21;&#x5F0F;&#xFF08;subshcema&#xFF09;&#x6216;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7528;&#x6237;&#x80FD;&#x591F;&#x770B;&#x89C1;&#x548C;&#x4F7F;&#x7528;&#x7684;&#x5C40;&#x90E8;&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x548C;&#x7279;&#x5F81;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;<strong>&#x662F;&#x6570;&#x636E;&#x5E93;&#x7528;&#x6237;&#x7684;&#x6570;&#x636E;&#x89C6;&#x56FE;&#xFF0C;&#x662F;&#x4E0E;&#x67D0;&#x4E00;&#x5E94;&#x7528;&#x6709;&#x5173;&#x7684;&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x8868;&#x793A;&#x3002;</strong></p>
<p>&#x5916;&#x6A21;&#x5F0F;&#x901A;&#x5E38;&#x662F;&#x6A21;&#x5F0F;&#x7684;&#x5B50;&#x96C6;&#x3002;<strong>&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x5916;&#x6A21;&#x5F0F;</strong>&#x3002;&#x5B83;&#x662F;&#x5404;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x6570;&#x636E;&#x89C6;&#x56FE;&#xFF0C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5916;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x5916;&#x6A21;&#x5F0F;&#x662F;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x5E93;&#x5B89;&#x5168;&#x6027;&#x7684;&#x4E00;&#x4E2A;&#x6709;&#x529B;&#x63AA;&#x65BD;&#x3002;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x53EA;&#x80FD;&#x770B;&#x89C1;&#x548C;&#x8BBF;&#x95EE;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x5916;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5176;&#x4F59;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;</p>
<p>&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;  &#x5916;&#x6A21;&#x5F0F;&#x6570;&#x636E;&#x5B9A;&#x4E49;&#x8BED;&#x8A00;&#xFF08;&#x5916;&#x6A21;&#x5F0F;DDL&#xFF09;  &#x6765;&#x4E25;&#x683C;&#x5B9A;&#x4E49;&#x6A21;&#x5F0F;&#x3002;</p>
<h5 id="3&#x5185;&#x6A21;&#x5F0F;-&#xFF08;internal-schema&#xFF09;">3.&#x5185;&#x6A21;&#x5F0F; &#xFF08;internal schema&#xFF09;</h5>
<p>&#x5185;&#x6A21;&#x5F0F;&#x4E5F;&#x79F0;&#x5B58;&#x50A8;&#x6A21;&#x5F0F;&#xFF0C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5185;&#x6A21;&#x5F0F;&#x3002;&#x5B83;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7269;&#x7406;&#x7ED3;&#x6784;&#x548C;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x662F;&#x6570;&#x636E;&#x5728;&#x6570;&#x636E;&#x5E93;&#x5185;&#x90E8;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x3002;</p>
<h4 id="&#x5C0F;&#x7ED3;">&#x5C0F;&#x7ED3;</h4>
<pre><code>&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x6709;&#x4E00;&#x4E2A; &#x6A21;&#x5F0F;&#x548C;&#x5185;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x5916;&#x6A21;&#x5F0F;&#xFF0C;&#x5916;&#x6A21;&#x5F0F;&#x901A;&#x5E38;&#x662F;&#x6A21;&#x5F0F;&#x7684;&#x5B50;&#x96C6;&#x3002;

&#x6A21;&#x5F0F;&#x662F;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;&#x516C;&#x5171;&#x6570;&#x636E;&#x89C6;&#x56FE;&#xFF0C;&#x5916;&#x6A21;&#x5F0F;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7528;&#x6237;&#x7684;&#x6570;&#x636E;&#x89C6;&#x56FE;

&#x5916;&#x6A21;&#x5F0F; &#x662F;&#x6570;&#x636E;&#x5E93;&#x5B89;&#x5168;&#x6027;&#x7684;&#x6709;&#x529B;&#x63AA;&#x65BD;&#x3002;
</code></pre><h3 id="133&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E8C;&#x7EA7;&#x6620;&#x50CF;&#x529F;&#x80FD;&#x4E0E;&#x6570;&#x636E;&#x72EC;&#x7ACB;&#x6027;">1.3.3&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E8C;&#x7EA7;&#x6620;&#x50CF;&#x529F;&#x80FD;&#x4E0E;&#x6570;&#x636E;&#x72EC;&#x7ACB;&#x6027;</h3>
<p>&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x4E09;&#x7EA7;&#x6A21;&#x5F0F;&#x662F;&#x6570;&#x636E;&#x7684;&#x4E09;&#x4E2A;&#x62BD;&#x8C61;&#x7EA7;&#x522B;&#xFF0C;&#x5B83;&#x628A;&#x6570;&#x636E;&#x7684;&#x5177;&#x4F53;&#x7EC4;&#x7EC7;&#x7559;&#x7ED9;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#xFF0C;&#x4F7F;&#x7528;&#x6237;&#x80FD;&#x591F;&#x903B;&#x8F91;&#x5730;&#x3001;&#x62BD;&#x8C61;&#x5730;&#x5904;&#x7406;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x5173;&#x5FC3;&#x6570;&#x636E;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x5177;&#x4F53;&#x65B9;&#x5F0F;&#x548C;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#x3002;<strong>&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x5728;&#x7CFB;&#x7EDF;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x8FD9;&#x4E09;&#x4E2A;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x8054;&#x7CFB;&#x548C;&#x8F6C;&#x5316;</strong>&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x5728;&#x8FD9;&#x4E09;&#x7EA7;&#x6A21;&#x5F0F;&#x4E4B;&#x95F4;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x5C42;&#x6620;&#x50CF;&#xFF1A;<strong>&#x5916;&#x6A21;&#x5F0F;/&#x6A21;&#x5F0F;&#x6620;&#x50CF;   &#x548C; &#x6A21;&#x5F0F;/&#x5185;&#x6A21;&#x5F0F;&#x6620;&#x50CF;&#x3002;</strong></p>
<p><strong>&#x6B63;&#x662F;&#x8FD9;&#x4E24;&#x5C42;&#x6620;&#x50CF;&#x4FDD;&#x8BC1;&#x4E86; &#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x80FD;&#x591F;&#x5177;&#x6709;&#x8F83;&#x9AD8;&#x7684;&#x903B;&#x8F91;&#x72EC;&#x7ACB;&#x6027;&#x548C;&#x7269;&#x7406;&#x72EC;&#x7ACB;&#x6027;&#x3002;</strong></p>
<h5 id="1-&#x5916;&#x6A21;&#x5F0F;&#x6A21;&#x5F0F;&#x6620;&#x50CF;">1. &#x5916;&#x6A21;&#x5F0F;/&#x6A21;&#x5F0F;&#x6620;&#x50CF;</h5>
<p>&#x6A21;&#x5F0F;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x6570;&#x636E;&#x7684;&#x5168;&#x5C40;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#xFF0C;&#x5916;&#x6A21;&#x5F0F;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x6570;&#x636E;&#x7684;&#x5C40;&#x90E8;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x3002;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x6709;&#x4EFB;&#x610F;&#x591A;&#x4E2A;&#x5916;&#x6A21;&#x5F0F;&#x3002;<strong>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x5916;&#x6A21;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5916;&#x6A21;&#x5F0F;/&#x6A21;&#x5F0F;&#x6620;&#x50CF;</strong>&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x8BE5;&#x5916;&#x6A21;&#x5F0F;&#x4E0E;&#x6A21;&#x5F0F;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x5F53;&#x6A21;&#x5F0F;&#x6539;&#x53D8;&#x65F6;&#xFF08;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5C5E;&#x6027;&#xFF0C;&#x6539;&#x53D8;&#x5C5E;&#x6027;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF09;&#x7B49;&#xFF0C;<strong>&#x7531;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;&#x5BF9;&#x5404;&#x4E2A;&#x5916;&#x6A21;&#x5F0F;/&#x6A21;&#x5F0F;&#x7684;&#x6620;&#x50CF;&#x4F5C;&#x76F8;&#x5E94;&#x6539;&#x53D8;&#xFF0C;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x5916;&#x6A21;&#x5F0F;&#x4E0D;&#x53D8;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BF4;&#x4F9D;&#x636E;&#x5916;&#x6A21;&#x5F0F;&#x5199;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E5F;&#x4E0D;&#x5FC5;&#x4FEE;&#x6539;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x6570;&#x636E;&#x4E0E;&#x7A0B;&#x5E8F;&#x7684;&#x903B;&#x8F91;&#x72EC;&#x7ACB;&#x6027;&#xFF0C;&#x7B80;&#x79F0;&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x72EC;&#x7ACB;&#x6027;&#x3002;</strong></p>
<h5 id="2&#x6A21;&#x5F0F;&#x5185;&#x6A21;&#x5F0F;&#x6620;&#x50CF;">2.&#x6A21;&#x5F0F;/&#x5185;&#x6A21;&#x5F0F;&#x6620;&#x50CF;</h5>
<p>&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5185;&#x6A21;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5; &#x6A21;&#x5F0F;/&#x5185;&#x6A21;&#x5F0F;&#x6620;&#x50CF;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x5B83;<strong>&#x5B9A;&#x4E49;&#x4E86;&#x6570;&#x636E;&#x5168;&#x5C40;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x4E0E;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;</strong>&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x903B;&#x8F91;&#x8BB0;&#x5F55;&#x548C;&#x5B57;&#x6BB5;&#x5728;&#x5185;&#x90E8;&#x662F;&#x5982;&#x4F55;&#x8868;&#x793A;&#x7684;&#x3002;&#x8BE5;&#x6620;&#x50CF;&#x5B9A;&#x4E49;&#x901A;&#x5E38;&#x5305;&#x542B;&#x5728;&#x6A21;&#x5F0F;&#x5B9A;&#x4E49;&#x4E2D;&#x3002;<strong>&#x5F53;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#xFF08;&#x6539;&#x7528;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF09;&#xFF0C;&#x7531;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;&#x5BF9;&#x6A21;&#x5F0F;/&#x5185;&#x6A21;&#x5F0F;&#x6620;&#x50CF;&#x4F5C;&#x76F8;&#x5E94;&#x6539;&#x53D8;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x6A21;&#x5F0F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x4ECE;&#x800C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E5F;&#x4E0D;&#x53D8;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x6570;&#x636E;&#x4E0E;&#x7A0B;&#x5E8F;&#x7684;&#x7269;&#x7406;&#x72EC;&#x7ACB;&#x6027;&#xFF0C;&#x7B80;&#x79F0; &#x6570;&#x636E;&#x7684;&#x7269;&#x7406;&#x72EC;&#x7ACB;&#x6027;&#x3002;</strong></p>
<h4 id="&#x5C0F;&#x7ED3;">&#x5C0F;&#x7ED3;</h4>
<pre><code>&#x6A21;&#x5F0F;&#x6539;&#x53D8;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;&#x5BF9;&#x76F8;&#x5E94; &#x5916;&#x6A21;&#x5F0F;/&#x6A21;&#x5F0F;&#x6620;&#x50CF;&#x505A;&#x51FA;&#x76F8;&#x5E94;&#x6539;&#x53D8;&#xFF0C;&#x5176;&#x4ED6;&#x53EF;&#x4E0D;&#x53D8; &#xFF0C;&#x903B;&#x8F91;&#x72EC;&#x7ACB;&#x6027;
&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x6539;&#x53D8;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;&#x5BF9; &#x6A21;&#x5F0F;/&#x5185;&#x6A21;&#x5F0F;&#x6620;&#x50CF;&#x4F5C;&#x6539;&#x53D8; &#x5176;&#x4ED6;&#x4E0D;&#x53D8;&#xFF0C;  &#x7269;&#x7406;&#x72EC;&#x7ACB;&#x6027;

&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5E93;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x5148;&#x786E;&#x5B9A;&#x6570;&#x636E;&#x5E93;&#x903B;&#x8F91;&#x7ED3;&#x6784;
</code></pre>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2.html" class="navigation navigation-prev " aria-label="Previous page: 1.2 数据模型">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="4.html" class="navigation navigation-next " aria-label="Next page: 1.4 数据库系统的组成">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.3 数据库系统的结构","level":"1.2.3","depth":2,"next":{"title":"1.4 数据库系统的组成","level":"1.2.4","depth":2,"path":"Part1/4.md","ref":"Part1/4.md","articles":[]},"previous":{"title":"1.2 数据模型","level":"1.2.2","depth":2,"path":"Part1/2.md","ref":"Part1/2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Part1/3.md","mtime":"2020-03-30T06:47:04.491Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-03-30T06:50:27.071Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

